#language: ru

@all
Функционал: Озон

  @iphones
  Сценарий: Айфоны
    * Выполнить поиск "iphone"
    * Указать "Цена" "до" "100000"
    * Отметить "Высокий рейтинг"
    * Отметить "NFC"
    * Добавить в корзину первые 8 четных товаров
    * Перйти в корзину
    * Проверить, что все добавленные ранее товары находятся в корзине
    * Проверить, что отображается текст "Ваша корзина" "8 товаров"
    * Удалить все товары из корзины
    * Проверить, что корзина не содержит никаких товаров
    * Добавить отчет

  @headphones
  Сценарий: Наушники
    * Выполнить поиск "беспроводные наушники"
    * Указать "Цена" "до" "10000"
    * Отметить "Beats"
    * Отметить "Samsung"
    * Отметить "Xiaomi"
    * Отметить "Высокий рейтинг"
    * Добавить в корзину все четные товары
    * Перйти в корзину
    * Проверить, что все добавленные ранее товары находятся в корзине
    * Удалить все товары из корзины
    * Проверить, что корзина не содержит никаких товаров
    * Добавить отчет
